package Lesson22;
/*
Создайте класс Анимал. Прие вызове его конструктора пусть на экран выводится "I am animal". В классе пусть будет переменная eyes, характерихующая колличество глаз;
методы eat(выводящий на экран "Animals Eats" и drink (выводящий на экран "animal drinks").
Создайте класс Pet?, который является child классом класса Animal. При вызове его конструктора пусть на жкран выводится "I am pet"  ии перменной eyes придается значение 2.
В классе пусть булет переменных name, Tail, характеризующая количество хвостов и равная 1; paw, характеризующая количество лап и равная 4;
методы run( выводящий на экран "Pet runs") b jump (выводящий на экран "Pet jumps").
Создайте класс Dog который является child классом Pet. При вызове его конструктора с параметрам, который будет передавать имя, пусть на экран
выводится "I am dog and my name is:"+ имя питомца. В классе добавьте метод play (выводящий на экран "Dog plays")
Создайте класс Cat который является child классом Pet. При вызове его конструктора с параметрам, который будет передавать имя, пусть на экран
выводится "I am cat and my name is:"+ имя питомца. В классе добавьте метод sleep (выводящий на экран "Cat sleeps")
Сщздайте класс Test, в методе main которого вывидите на экран количество лап обьекта класса Dog и вызовите sleep оббьекта класса Cat.
 */
public class HomeWork2 {
}
