package Lesson22;
/*Создайте класс СТудент со след пременнными: name(StringBuilder), course? grade. Приминет инкапсюляцию к данному классу.
Длина имени обьектов не должна быть менее 3ч символов, оценки должны быть числами в интервале от 1 до 10, курс должен быть
числом от 1 до4 включительно.
Создайте метод showinfo, который будет выводить всю информацию о студенте, не используя переменные класса Студент, придайте его переменным значения.
Произведите вызов метода Showinfo.
 */
public class HomeWork {

}
